## Plan Result (sbox-aks)




<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_resource_group.kubernetes_resource_group[&#34;00&#34;]
  * azurerm_resource_group.kubernetes_resource_group[&#34;01&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_resource_group.kubernetes_resource_group["00"] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ss-sbox-00-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_resource_group.kubernetes_resource_group["01"] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ss-sbox-01-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # module.kubernetes["00"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_key_vault.hmcts_access_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "hmcts_access_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "ca8140a9e09e2ee23f7abkv"
      + network_acls                    = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "azure-control-sbox-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_key_vault_secret.aks_admin_group_id will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "aks_admin_group_id" {
      + content_type   = (known after apply)
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "aks-admin-rbac-group-id"
      + tags           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_key_vault_secret.kubernetes_cluster_client_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "kubernetes_cluster_client_secret" {
      + content_type   = (known after apply)
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "sp-token"
      + tags           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_resource_group.disks_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "disks-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_resource_group.genesis_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "genesis_rg" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "genesis-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_resource_group.managed-identity-operator will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "managed-identity-operator" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "managed-identities-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_resource_group.node_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "node_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "ss-sbox-00-aks-node-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_role_definition.builtin_role_definition will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_role_definition" "builtin_role_definition" {
      + assignable_scopes  = (known after apply)
      + description        = (known after apply)
      + id                 = (known after apply)
      + name               = "Contributor"
      + permissions        = (known after apply)
      + role_definition_id = (known after apply)
      + scope              = (known after apply)
      + type               = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_subnet.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "aks" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "aks-00"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "ss-sbox-network-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "ss-sbox-vnet"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_subscription.subscription will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "subscription" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_user_assigned_identity.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "aks-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_user_assigned_identity.kubelet_uami[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "kubelet_uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "aks-kubelet-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + dns_prefix                          = "k8s-ss-sbox-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.22.6"
      + location                            = "uksouth"
      + name                                = "ss-sbox-00-aks"
      + node_resource_group                 = "ss-sbox-00-aks-node-rg"
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "ss-sbox-00-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = (known after apply)
          + azure_rbac_enabled     = false
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 50
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.22.6"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + tags                         = {
              + "application"  = "core"
              + "builtFrom"    = "hmcts/aks-sds-deploy"
              + "businessArea" = "Cross-Cutting"
              + "criticality"  = "Low"
              + "environment"  = "sandbox"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_DS3_v2"
          + vnet_subnet_id               = (known after apply)
          + zones                        = [
              + "1",
            ]
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCqPFmlkJn9vCOklB9wOJEAr+h36naEvWCH2LP6wVMTnbWkgwwhRvtVGeFeDo5jhlTJGk8/RyCnuQpoKfvfYNqr/5fhr0xa7CNJhb2NdUmv8u811APXKaf8psElQz4LzFb6HBcKapkVB1DQwUCVREY+BCnXtBZ1v6V24TO9YbJASs/BaPgZQJLThVGNe24jV0zRWDAy1RElPT8P1wO4k5hoDXg4NRoQt5IxqcpTUncVGN705ggqLf96zS70fPVlhLL5L6yBv4/0y9t4uo7NR5mKwDIRlpyXONpFpMGzj0zWLm/HDQqZNrD4Ycs2UolJcBk+YlUXTV6VyrnpmyKoVGvlOW8IpJLASW8HalNeOWTw5WsbjpY8rCrgasO6lMC3tI7t8yqFHFJ+EAqYZtVJoLO+ag97QZADlm2vcvctSGCAr8hqwYfb2UqqlDTuX/H8USqelCNa5NJAH7IMF1p1M9n0ohvT91U3KdtUvgu/8psuIXD1iEDNKQ3gwManbeRQ79M="
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 4
      + max_pods              = 30
      + min_count             = 2
      + mode                  = "User"
      + name                  = "linux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = "1.22.6"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS3_v2"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
        ]
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 4
      + max_pods              = 30
      + min_count             = 2
      + mode                  = "User"
      + name                  = "msnode"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "kubernetes.io/os=windows:NoSchedule",
        ]
      + orchestrator_version  = "1.22.6"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Windows"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS3_v2"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
        ]
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                       = "DiagLogAnalytics"
      + target_resource_id         = (known after apply)

      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.kubernetes["00"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_key_vault.hmcts_access_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "hmcts_access_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "ca8140a9e09e2ee23f7abkv"
      + network_acls                    = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "azure-control-sbox-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_key_vault_secret.aks_admin_group_id will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "aks_admin_group_id" {
      + content_type   = (known after apply)
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "aks-admin-rbac-group-id"
      + tags           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_key_vault_secret.kubernetes_cluster_client_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "kubernetes_cluster_client_secret" {
      + content_type   = (known after apply)
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "sp-token"
      + tags           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_resource_group.disks_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "disks-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_resource_group.genesis_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "genesis_rg" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "genesis-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_resource_group.managed-identity-operator will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "managed-identity-operator" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "managed-identities-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_resource_group.node_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "node_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "ss-sbox-01-aks-node-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_role_definition.builtin_role_definition will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_role_definition" "builtin_role_definition" {
      + assignable_scopes  = (known after apply)
      + description        = (known after apply)
      + id                 = (known after apply)
      + name               = "Contributor"
      + permissions        = (known after apply)
      + role_definition_id = (known after apply)
      + scope              = (known after apply)
      + type               = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_subnet.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "aks" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "aks-01"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "ss-sbox-network-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "ss-sbox-vnet"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_subscription.subscription will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "subscription" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_user_assigned_identity.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "aks-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].data.azurerm_user_assigned_identity.kubelet_uami[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "kubelet_uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "aks-kubelet-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + dns_prefix                          = "k8s-ss-sbox-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.22.6"
      + location                            = "uksouth"
      + name                                = "ss-sbox-01-aks"
      + node_resource_group                 = "ss-sbox-01-aks-node-rg"
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "ss-sbox-01-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = (known after apply)
          + azure_rbac_enabled     = false
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 50
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.22.6"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + tags                         = {
              + "application"  = "core"
              + "builtFrom"    = "hmcts/aks-sds-deploy"
              + "businessArea" = "Cross-Cutting"
              + "criticality"  = "Low"
              + "environment"  = "sandbox"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_DS3_v2"
          + vnet_subnet_id               = (known after apply)
          + zones                        = [
              + "1",
            ]
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCqPFmlkJn9vCOklB9wOJEAr+h36naEvWCH2LP6wVMTnbWkgwwhRvtVGeFeDo5jhlTJGk8/RyCnuQpoKfvfYNqr/5fhr0xa7CNJhb2NdUmv8u811APXKaf8psElQz4LzFb6HBcKapkVB1DQwUCVREY+BCnXtBZ1v6V24TO9YbJASs/BaPgZQJLThVGNe24jV0zRWDAy1RElPT8P1wO4k5hoDXg4NRoQt5IxqcpTUncVGN705ggqLf96zS70fPVlhLL5L6yBv4/0y9t4uo7NR5mKwDIRlpyXONpFpMGzj0zWLm/HDQqZNrD4Ycs2UolJcBk+YlUXTV6VyrnpmyKoVGvlOW8IpJLASW8HalNeOWTw5WsbjpY8rCrgasO6lMC3tI7t8yqFHFJ+EAqYZtVJoLO+ag97QZADlm2vcvctSGCAr8hqwYfb2UqqlDTuX/H8USqelCNa5NJAH7IMF1p1M9n0ohvT91U3KdtUvgu/8psuIXD1iEDNKQ3gwManbeRQ79M="
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 4
      + max_pods              = 30
      + min_count             = 2
      + mode                  = "User"
      + name                  = "linux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = "1.22.6"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS3_v2"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
        ]
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 4
      + max_pods              = 30
      + min_count             = 2
      + mode                  = "User"
      + name                  = "msnode"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "kubernetes.io/os=windows:NoSchedule",
        ]
      + orchestrator_version  = "1.22.6"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Windows"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS3_v2"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
        ]
    }

  # module.kubernetes["01"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                       = "DiagLogAnalytics"
      + target_resource_id         = (known after apply)

      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.kubernetes["01"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":232,"Program":"tfcmt","SHA1":"","Target":"sbox-aks","Vars":{}} -->